{
  "nodes": [
    {
      "op": "null", 
      "name": "rand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "g1_weight", 
      "attrs": {
        "kernel": "(4,4)", 
        "no_bias": "true", 
        "num_filter": "112", 
        "pad": "(0,0)", 
        "stride": "(1,1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "g1", 
      "attrs": {
        "kernel": "(4,4)", 
        "no_bias": "true", 
        "num_filter": "112", 
        "pad": "(0,0)", 
        "stride": "(1,1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gbn1_gamma", 
      "attrs": {
        "eps": "1.0000001E-5", 
        "fix_gamma": "true"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gbn1_beta", 
      "attrs": {
        "eps": "1.0000001E-5", 
        "fix_gamma": "true"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gbn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.0000001E-5", 
        "fix_gamma": "true"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gbn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.0000001E-5", 
        "fix_gamma": "true"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "gbn1", 
      "attrs": {
        "eps": "1.0000001E-5", 
        "fix_gamma": "true"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "gact1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "g2_weight", 
      "attrs": {
        "kernel": "(4,4)", 
        "no_bias": "true", 
        "num_filter": "56", 
        "pad": "(1,1)", 
        "stride": "(2,2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "g2", 
      "attrs": {
        "kernel": "(4,4)", 
        "no_bias": "true", 
        "num_filter": "56", 
        "pad": "(1,1)", 
        "stride": "(2,2)"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gbn2_gamma", 
      "attrs": {
        "eps": "1.0000001E-5", 
        "fix_gamma": "true"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gbn2_beta", 
      "attrs": {
        "eps": "1.0000001E-5", 
        "fix_gamma": "true"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gbn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.0000001E-5", 
        "fix_gamma": "true"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gbn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.0000001E-5", 
        "fix_gamma": "true"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "gbn2", 
      "attrs": {
        "eps": "1.0000001E-5", 
        "fix_gamma": "true"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 1], [14, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "gact2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "g3_weight", 
      "attrs": {
        "kernel": "(4,4)", 
        "no_bias": "true", 
        "num_filter": "28", 
        "pad": "(1,1)", 
        "stride": "(2,2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "g3", 
      "attrs": {
        "kernel": "(4,4)", 
        "no_bias": "true", 
        "num_filter": "28", 
        "pad": "(1,1)", 
        "stride": "(2,2)"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gbn3_gamma", 
      "attrs": {
        "eps": "1.0000001E-5", 
        "fix_gamma": "true"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gbn3_beta", 
      "attrs": {
        "eps": "1.0000001E-5", 
        "fix_gamma": "true"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gbn3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.0000001E-5", 
        "fix_gamma": "true"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gbn3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.0000001E-5", 
        "fix_gamma": "true"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "gbn3", 
      "attrs": {
        "eps": "1.0000001E-5", 
        "fix_gamma": "true"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0], [21, 0, 1], [22, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "gact3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "g4_weight", 
      "attrs": {
        "kernel": "(4,4)", 
        "no_bias": "true", 
        "num_filter": "28", 
        "pad": "(0,0)", 
        "stride": "(2,2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "g4", 
      "attrs": {
        "kernel": "(4,4)", 
        "no_bias": "true", 
        "num_filter": "28", 
        "pad": "(0,0)", 
        "stride": "(2,2)"
      }, 
      "inputs": [[24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gbn4_gamma", 
      "attrs": {
        "eps": "1.0000001E-5", 
        "fix_gamma": "true"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gbn4_beta", 
      "attrs": {
        "eps": "1.0000001E-5", 
        "fix_gamma": "true"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gbn4_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.0000001E-5", 
        "fix_gamma": "true"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gbn4_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.0000001E-5", 
        "fix_gamma": "true"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "gbn4", 
      "attrs": {
        "eps": "1.0000001E-5", 
        "fix_gamma": "true"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0], [29, 0, 1], [30, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "gact4", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "g5_weight", 
      "attrs": {
        "kernel": "(4,4)", 
        "no_bias": "true", 
        "num_filter": "28", 
        "pad": "(2,2)", 
        "stride": "(2,2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "g5", 
      "attrs": {
        "kernel": "(4,4)", 
        "no_bias": "true", 
        "num_filter": "28", 
        "pad": "(2,2)", 
        "stride": "(2,2)"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gbn5_gamma", 
      "attrs": {
        "eps": "1.0000001E-5", 
        "fix_gamma": "true"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gbn5_beta", 
      "attrs": {
        "eps": "1.0000001E-5", 
        "fix_gamma": "true"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gbn5_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.0000001E-5", 
        "fix_gamma": "true"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gbn5_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.0000001E-5", 
        "fix_gamma": "true"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "gbn5", 
      "attrs": {
        "eps": "1.0000001E-5", 
        "fix_gamma": "true"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0], [37, 0, 1], [38, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "gact5", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "g7_weight", 
      "attrs": {
        "kernel": "(4,4)", 
        "no_bias": "true", 
        "num_filter": "3", 
        "pad": "(3,3)", 
        "stride": "(2,2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "g7", 
      "attrs": {
        "kernel": "(4,4)", 
        "no_bias": "true", 
        "num_filter": "3", 
        "pad": "(3,3)", 
        "stride": "(2,2)"
      }, 
      "inputs": [[40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gact7", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[42, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    3, 
    4, 
    5, 
    6, 
    9, 
    11, 
    12, 
    13, 
    14, 
    17, 
    19, 
    20, 
    21, 
    22, 
    25, 
    27, 
    28, 
    29, 
    30, 
    33, 
    35, 
    36, 
    37, 
    38, 
    41
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    50, 
    51, 
    52, 
    53, 
    54
  ], 
  "heads": [[43, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10300]}
}